// Задача 10
//
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа

// Console.Write("Введите трехзначное число: ");
// string str = Console.ReadLine();
// int i = str.Length;
// if(i != 3)
// {
//     Console.WriteLine("Введено неверное число");
// } else
//     {
//         int N = Convert.ToInt32(str);
//         N = N/10;
//         N = N%10;
//         Console.WriteLine(N);
//     }


//Задача 13

//Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет 

// Console.Write("Введите число: ");
// string str = Console.ReadLine();
// int i = str.Length;
// if(i < 3)
// {
//     Console.WriteLine("В числе нет третьей цифры");
// } else
//     {
//         Console.WriteLine(str[2]);
//     }   
    
// Задача 15

// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным

// Console.Write("Введите цифру от 1 до 7: ");
// int N = Convert.ToInt32(Console.ReadLine());
// if(N<1 || N>7)
// {
//     Console.WriteLine("Неверно введена цифра");
// } else
//     {
//         if(N==6 || N==7)
//         {
//             Console.WriteLine("День выходной");
//         } else
//             {
//                 Console.WriteLine("День не выходной");
//             }
//     }
